# Lab2

In [ ]:
Name: Elena Pashkova
Student ID: n01587121

Read the Salaries.csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [2]:
#Write your code here

import pandas as pd

#The header=0 means column names are in the first row
df=pd.read_csv("Salaries.csv", header=0)

#The head method returns the first five rows
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

Use the dtypes attribute to view how each column is stored

In [3]:
# .dtypes Returns the datatype of each column 
df.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
Benefits            float64
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status              float64
dtype: object

Slice the first two columns using .loc and store the result in a variable.

In [10]:
sliced_df = df.loc[:, df.columns[:2]]
print(sliced_df)

# df.loc[]: This is the location-based indexing function.
# : When used before the comma, it indicates that we're selecting all rows.
# df.columns[:2]: This retrieves the first two column names of the DataFrame. 
# The [:2] is a slice operation on the columns,
# which selects the columns at index 0 and 1 (i.e., the first two columns).

            Id       EmployeeName
0            1     NATHANIEL FORD
1            2       GARY JIMENEZ
2            3     ALBERT PARDINI
3            4  CHRISTOPHER CHONG
4            5    PATRICK GARDNER
...        ...                ...
148649  148650      Roy I Tillery
148650  148651       Not provided
148651  148652       Not provided
148652  148653       Not provided
148653  148654          Joe Lopez

[148654 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable

In [3]:
df.loc[:1]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

Compute the average and max TotalPay.  Store the results in variables called avg_TotalPay and max_TotalPay

In [4]:
# The .mean() function on a column will compute the average of all the values in that column.
avg_TotalPay = df['TotalPay'].mean()
print(avg_TotalPay)

# For max we use .max() function.
max_TotalPay = df['TotalPay'].max()
print(max_TotalPay )

74768.32197169267
567595.43

Create a column called "final", which is BasePay*2.

In [6]:
# Creating new column 'final' based on double of 'BasePay'
df['final'] = df['BasePay'] * 2

Use the drop() method to delete the column OvertimePay from the dataframe df_data.

In [12]:
df.drop('OvertimePay', axis=1, inplace=True)
print(df)
# drop(): This is a method provided to drop specified labels from rows or columns.
# axis=1: This represents columns.
# inplace=True: means the operation to modify the original DataFrame in place and not return a new one.

            Id       EmployeeName  \
0            1     NATHANIEL FORD
1            2       GARY JIMENEZ
2            3     ALBERT PARDINI
3            4  CHRISTOPHER CHONG
4            5    PATRICK GARDNER
...        ...                ...
148649  148650      Roy I Tillery
148650  148651       Not provided
148651  148652       Not provided
148652  148653       Not provided
148653  148654          Joe Lopez

                                              JobTitle    BasePay   OtherPay  \
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  167411.18  400184.25
1                      CAPTAIN III (POLICE DEPARTMENT)  155966.02  137811.38
2                      CAPTAIN III (POLICE DEPARTMENT)  212739.13   16452.60
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC   77916.00  198306.90
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)  134401.60  182234.59
...                                                ...        ...        ...
148649                                       Custodian       0.00       0.00
148650                                    Not provided        NaN        NaN
148651                                    Not provided        NaN        NaN
148652                                    Not provided        NaN        NaN
148653                      Counselor, Log Cabin Ranch       0.00    -618.13

        Benefits   TotalPay  TotalPayBenefits  Year  Notes         Agency  \
0            NaN  567595.43         567595.43  2011    NaN  San Francisco
1            NaN  538909.28         538909.28  2011    NaN  San Francisco
2            NaN  335279.91         335279.91  2011    NaN  San Francisco
3            NaN  332343.61         332343.61  2011    NaN  San Francisco
4            NaN  326373.19         326373.19  2011    NaN  San Francisco
...          ...        ...               ...   ...    ...            ...
148649       0.0       0.00              0.00  2014    NaN  San Francisco
148650       NaN       0.00              0.00  2014    NaN  San Francisco
148651       NaN       0.00              0.00  2014    NaN  San Francisco
148652       NaN       0.00              0.00  2014    NaN  San Francisco
148653       0.0    -618.13           -618.13  2014    NaN  San Francisco

        Status      final
0          NaN  334822.36
1          NaN  311932.04
2          NaN  425478.26
3          NaN  155832.00
4          NaN  268803.20
...        ...        ...
148649     NaN       0.00
148650     NaN        NaN
148651     NaN        NaN
148652     NaN        NaN
148653     NaN       0.00

[148654 rows x 13 columns]

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [10]:
import pandas as pd

#The header=0 means column names are in the first row
df_titanic=pd.read_csv("Titanic.csv", header=0)

#The head method returns the first five rows
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [13]:
# Using .rename method for the DataFrame,renaming by column.
df_titanic = df_titanic.rename(columns={"Name": "Passenger_Name", "Ticket": "Ticket_Num"})

Select the name of passenger 896

In [5]:
# Used filter the DataFrame based on the "PassengerId" column to get the desired name.
# .iloc stands for "integer-location based indexing". It's used for selecting data by its row or column position. 
passenger_name = df_titanic[df_titanic['PassengerId'] == 896]['Passenger_Name'].iloc[0]
print(passenger_name)

Hirvonen, Mrs. Alexander (Helga E Lindqvist)

How many missing entries are there in the Age column?

In [6]:
# `df_titanic.isnull()` returns a DataFrame of the same shape as `df_titanic` where each cell is either True or False.
# True if the corresponding cell in `df_titanic` is NaN (or missing) and False otherwise.

# `df_titanic.isnull().sum()` returns a Series where each value is the sum of True values (i.e., count of NaNs) 
# for each column in the original DataFrame.

# `df_titanic.isnull().sum()["Age"]` gets the sum of NaNs (or missing values) in the "Age" column specifically.

df_titanic.isnull().sum()["Age"]

86

Compute the avg age of passengers ignoring the missing data.

In [9]:
# Using the mean() method on the "Age" column.
average_age = round(df_titanic['Age'].mean(), 2)
print(average_age)

30.27

Using the fillna() method replace the missing values in the Age column with the mean.

In [10]:
# Calculate the mean of the Age column
mean_age = df_titanic['Age'].mean()

# Replace NaN values in Age column with the mean_age
df_titanic['Age'].fillna(mean_age, inplace=True)

In [ ]:
#Bonus: for students who wants to practice more

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [12]:
# Sort the dataframe by Age in descending order
sorted_df = df_titanic.sort_values(by='Age', ascending=False)

# Reset the index of the sorted dataframe
sorted_df = sorted_df.reset_index(drop=True)

In [13]:
# Calculate the average age of the 5 oldest passengers
average_age_of_oldest_5 = sorted_df['Age'].head(5).mean()
print(average_age_of_oldest_5)

67.0